apples = 41
boxes = 3
busy_boxes = 41 // 3
free_apples = 41 % 3
print('Заполнено ящиков:', busy_boxes, ',', 'осталось яблок:', free_apples)
# Задача на свободные яблоки и занятые ящики