n = int(input('Введите количество минут: '))
hour = n // 60
minute = n % 60
print('Количество часов:', hour)
print('Количество минут:', minute)
#Создать часы =_=