x, y = int(input()), int(input())
if x > y:
    print('X больше Y')
if x == y:
    print('X равен Y')
if x < y:
    print('X меньше Y')
#Задача на сравнение координат