stanok, ploschad = int(input('Введите количество станков: ')), int(input('Введите площадь: '))
if stanok >= 5 and ploschad >= 100:
    print('Подходит')
else:
    print('Не подходит')
#Задача на определение площади и количества