a, b, c, d = int(input('Введите число: ')), int(input('Введите число: ')), int(input('Введите число: ')), int(input('Введите число: '))
sum_1 = a + b
sum_2 = c + d
res = sum_1 / sum_2
print(res)
#Задача на определение дохода за год по двум кварталам / на два квартала