medal, points = int(input('Если есть золотая медаль, введи 1, если нет, введи 0: ')), int(input('Введи количество баллов: '))
if medal == 1 and points >= 290:
    print('Ты поступил!')
else:
    print('К сожалению, вы не проходите.')
#Задача на поступление в ВУЗ
