bank = int(input('Введите сумму для снятия: '))
if bank % 100 != 0:
    print('Данную сумму снять невозможно. Обратитесь в другой банкомат')
#Задача на снятие 100 рублей с банкомата без остатка