distance = int(input('Сколько проехали: '))
km = 190
if distance <= km:
    print('Вы ещё не приехали, осталось ехать:', km - distance)
#Задача с if на навигатор