son = int(input('Введите число: '))
father = 8
if son == father:
    print('Угадал!')
else:
    print('Не угадал!')
print('Конец игры.')
#Задача угадай число