days_1, days_2, days_3 = int(input('Введите количество дней:')), int(input('Введите количество дней:')), int(input('Введите количество дней:'))
years_1, years_2, years_3 = days_1 // 365, days_2 // 365, days_3 // 365
print(years_1, years_2, years_3)
# Задача на определение количества лет по известному количеству дней (если в году всегда 365 дней)