num_1, num_2 = int(input('Введите первое число: ')), int(input('Введите второе число: '))
if num_1 % 2 == 1 or num_2 % 2 == 1:
    print('Есть чётное число')
else:
    print('Нет чётного числа')
#Задача на чётные числа