bank = int(input('Количество денег на счёте: '))
if bank >= 75000:
    bank -= 75000
    print('Деньги успешно списаны.')
else:
    print('Недостаточно деняк.')
print('Хорошего дня!')
#Задача на if и else для понимания