rain = int(input('На улице идёт дождь? '))
if rain == 1:
    print('Идёт дождь, возьмите зонт!')
#Задача датчик погоды