x = int(input('Введите число: '))
y = x
if x > 0:
    y = x - 12
    print('Игрек равен: ', y)
elif x == 0:
    y = 5
    print('Игрек равен: ', y)
else:
    y = x**2
    print('Игрек равен:', y)
#Задача на функции