v, t = int(input('Введите скорость: ')), int(input('Введите время: '))
s = v * t % 115
print(s)
#Задача на определение расстояния

