number = int(input('Введите двузначное число: '))
if number > 9 and number < 100 or number < -9 and number > -100:
    print('Число двузначное')
else:
    print('Неверное число')
#Задача на определение двузначного числа