year, speed = int(input('Введите год выпуска: ')), int(input('Введите скорость: '))
if year >= 2018 and speed >= 24:
    print('Соответствует условиям')
else:
    print('Не соответствует условиям')
#Задача на подбор определённых велосипедов