price = int(input('Введите количество денежных средств на карте: '))
if price >= 75000:
    print('Курс успешно приобретён!')
    print('Хорошего дня!')
#Задача на if