taska = input('Решите пример: 50 * 2 ** 3 − 32. Ответ введите здесь: ')
print('Ваш ответ:', taska)
print('Правильный ответ: 368')
#Задача, просто задача
