t = int(input('Введите температуру: '))
if t < 0 or t > 100:
    print('Опасная температура!')
else:
    print('Температура комфортная!')
#Задача на определение температуры