ex_1, ex_2, ex_3 = int(input('Введите количество баллов по русскому: ' )), int(input('Введите количество баллов по химии: ')), int(input('Введите количество баллов по биологии: '))
if ex_1 + ex_2 + ex_3 >= 270:
    print('Поздравляю, вы сможете поступить!')
else:
    print('Видно, не судьба')
#Задача на поступление